quest_system_1128967992_name=^?^The Deserted Castle
quest_system_1128967992_stage_0=^?^Find the portrait of the great warrior, Sir Radcliffe. There is a secret entryway behind this portrait.
quest_system_1128967992_stage_1=^?^Find the treasure.
quest_system_1128967992_stage_2=^?^Return to Sir Richard.
quest_system_1128967992_stage_3=^?^Return the treasure to King Mark Leonard's treasury.
quest_system_1128967992_task=^?^Sir Richard Harmon has told you of the mystery of the deserted castle. The royal treasure has never been found! The secret entryway remains hidden, and terrible ghosts attack all who would approach the treasury.
